eisup_2019_docmng_integration/src/Reports/абс_ПроверкаСтатусовДоговоров/абс_ПроверкаСтатусовДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>абс_ПроверкаСтатусовДоговоров</name>
  <attributes>
    <name>УниверсальныйОтчет</name>
    <type>
      <types>ReportObject.УниверсальныйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДоговора</name>
    <type>
      <types>EnumRef.абсСтатусыДоговоров</types>
    </type>
  </attributes>
</mdclass:Report>

eisup_2019_docmng_integration/src/InformationRegisters/РолиИИсполнители/РолиИИсполнители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиИИсполнители</name>
  <resources>
    <name>абс_ИндексИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абсСтатусыДоговоров/абсСтатусыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыДоговоров</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПервоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Закрытие</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДВКУР</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПВП</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеквизитовДоговора</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДСменаОтветственного</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДИБ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДирКСП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемПД</name>
  </enumValues>
  <enumValues>
    <name>ОдобрениеСДилиОСА</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФКПослеКоррректировки</name>
  </enumValues>
  <enumValues>
    <name>ОтказПослеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехБлоком</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАудитором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеПДМКР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДСиМТО</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехническимДиректором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеКазначейством</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДТПиР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАД</name>
  </enumValues>
  <enumValues>
    <name>ttk_ВалютныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеЦФК</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/РолиИсполнителей/РолиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиИсполнителей</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеИспользуется</name>
      <description>_Не используется</description>
    </items>
    <items>
      <name>СогласованиеДоговоровПодрядаНеИСП</name>
      <description>(Не исп.) Согласование договоров подряда</description>
    </items>
    <items>
      <name>Бухгалтерия</name>
      <description>Бухгалтерия</description>
    </items>
    <items>
      <name>ДФМ</name>
      <description>ДФМ</description>
    </items>
    <items>
      <name>НастройкаПрав</name>
      <description>Настройка прав</description>
    </items>
    <items>
      <name>НачислениеРНПД</name>
      <description>Начисление РНПД</description>
    </items>
    <items>
      <name>ОбщиеРоли</name>
      <description>Общие роли</description>
    </items>
    <items>
      <name>Поддержка</name>
      <description>Поддержка</description>
    </items>
    <items>
      <name>ПроектныйУчет</name>
      <description>Проектный учет</description>
    </items>
    <items>
      <name>РаботаСДоговорами</name>
      <description>Работа с договорами</description>
    </items>
    <items>
      <name>РолиИСУЗК</name>
      <description>Роли ИСУЗК</description>
    </items>
    <items>
      <name>СогласованиеАктовПриёмкиВыполненныхРабот</name>
      <description>Согласование актов приёмки выполненных работ</description>
    </items>
    <items>
      <name>СогласованиеБюджета</name>
      <description>Согласование бюджета</description>
    </items>
    <items>
      <name>СогласованиеДоговоровПодряда</name>
      <description>Согласование договоров подряда</description>
    </items>
    <items>
      <name>ЗакупочныеЗаказыСчета</name>
      <description>Согласование закупочных заказов и счетов</description>
    </items>
    <items>
      <name>СогласованиеЗаявокНаОбеспечениеТМЦ</name>
      <description>Согласование заявок на обеспечение ТМЦ</description>
    </items>
    <items>
      <name>СогласованиеОС</name>
      <description>Согласование ОС</description>
    </items>
    <items>
      <name>ttk_Аудитор</name>
      <description>Аудитор</description>
    </items>
    <items>
      <name>БюджетныйКонтролер</name>
      <description>Бюджетный контролер</description>
    </items>
    <items>
      <name>ttk_ВалютныйКонтроль</name>
      <description>Валютный контроль</description>
    </items>
    <items>
      <name>ВводКЗР</name>
      <description>Ввод КЗР</description>
    </items>
    <items>
      <name>ВводОперацияБУНУ</name>
      <description>Ввод операция БУНУ</description>
    </items>
    <items>
      <name>УстановкаСоответствияАналитикВыручки</name>
      <description>Ввод соответствий аналитик выручки</description>
    </items>
    <items>
      <name>ДирККР</name>
      <description>Дир ККР</description>
    </items>
    <items>
      <name>ДирККРвКТТК</name>
      <description>Дир ККР в КТТК</description>
    </items>
    <items>
      <name>ttk_РуководительБП</name>
      <description>Начальник бюджетного планирования</description>
    </items>
    <items>
      <name>ОтказПоАвизо</name>
      <description>Отказ по авизо</description>
    </items>
    <items>
      <name>ОткрытиеДокументаИнтеграцияСHyperion</name>
      <description>Открытие и работа с документом Интеграция с hyperion</description>
    </items>
    <items>
      <name>ОформлениеАВЗ</name>
      <description>Оформление АВЗ</description>
    </items>
    <items>
      <name>Переутверждение</name>
      <description>Переутверждение</description>
    </items>
    <items>
      <name>ПроведениеППДБезКонтроляМаппинга</name>
      <description>Проведение ППД без контроля маппинга</description>
    </items>
    <items>
      <name>РедактированиеДатыРасходаЗРС</name>
      <description>Редактирование даты расхода ЗРС</description>
    </items>
    <items>
      <name>РедактированиеППДБезКонтроляДатыЗапрета</name>
      <description>Редактирование ППД без контроля даты запрета</description>
    </items>
    <items>
      <name>ttk_РуководительДБО</name>
      <description>Руководитель департамента бюджетирования и отчетности</description>
    </items>
    <items>
      <name>РуководительДК</name>
      <description>Руководитель ДК</description>
    </items>
    <items>
      <name>РуководительПД</name>
      <description>Руководитель ПД</description>
    </items>
    <items>
      <name>СогласованиеДИБ</name>
      <description>Согласование ДИБ</description>
    </items>
    <items>
      <name>СогласованиеДРСД</name>
      <description>Согласование ДРСД</description>
    </items>
    <items>
      <name>СогласованиеДРУ</name>
      <description>Согласование ДРУ</description>
    </items>
    <items>
      <name>СогласованиеДУП</name>
      <description>Согласование ДУП</description>
    </items>
    <items>
      <name>СогласованиеДЭБ</name>
      <description>Согласование ДЭБ</description>
    </items>
    <items>
      <name>ttk_СогласованиеЗакупкиМКР</name>
      <description>Согласование Закупки МКР</description>
    </items>
    <items>
      <name>СогласованиеКонтрагентовЮристами</name>
      <description>Согласование контрагентов юристами</description>
    </items>
    <items>
      <name>СогласованиеКТТК</name>
      <description>Согласование КТТК (филиалы)</description>
    </items>
    <items>
      <name>СогласованиеПД</name>
      <description>Согласование ПД</description>
    </items>
    <items>
      <name>СогласованиеПЛ</name>
      <description>Согласование Первым лицом</description>
    </items>
    <items>
      <name>СогласованиеРекласификацииБюджетаДЭИ</name>
      <description>Согласование рекласификации бюджета (ДЭИ)</description>
    </items>
    <items>
      <name>СогласованиеРуководителяДКП</name>
      <description>Согласование руководителя ДКП</description>
    </items>
    <items>
      <name>СогласованиеРуководителяДОП</name>
      <description>Согласование руководителя ДОП</description>
    </items>
    <items>
      <name>СогласованиеСОКДЭБ</name>
      <description>Согласование СОК (ДЭБ)</description>
    </items>
    <items>
      <name>СогласованиеДВКУР</name>
      <description>Согласование ЦОЗД КТТК</description>
    </items>
    <items>
      <name>ttk_СогласованиеЦФК</name>
      <description>Согласование ЦФК</description>
    </items>
    <items>
      <name>СотрудникГруппыНСИ</name>
      <description>Сотрудник группы НСИ</description>
    </items>
    <items>
      <name>СотрудникДК</name>
      <description>Сотрудник ДК</description>
    </items>
    <items>
      <name>СотрудникСклада</name>
      <description>Сотрудник склада</description>
    </items>
    <items>
      <name>СуперПользователь</name>
      <description>Супер пользователь</description>
    </items>
    <items>
      <name>СуперПользовательДЗО</name>
      <description>Супер пользователь ДЗО</description>
    </items>
    <items>
      <name>ТипКонтрагентаМСФО</name>
      <description>Тип контрагента (МСФО)</description>
    </items>
    <items>
      <name>абс_ТрансфертноеЦенообразование</name>
      <description>Трансфертное ценообразование</description>
    </items>
    <items>
      <name>УстановкаПроектаСтатьи</name>
      <description>Установка проекта статьи</description>
    </items>
  </predefined>
  <attributes>
    <name>абс_РольИСУЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Reports/абс_ПроверкаСтатусовДоговоров/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	 УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	 УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Истина;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.абс_СтатусДоговора КАК СтатусДоговора,
	|	абсЗадачаДоговора.Ссылка КАК Задача,
	|	абсЗадачаДоговора.Исполнитель,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент
	|{ВЫБРАТЬ
	|	ДоговорКонтрагента.*,
	|	СтатусДоговора.*,
	|	Задача.*,
	|	Исполнитель.*,
	|	Контрагент.*}
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.абсЗадачаДоговора КАК абсЗадачаДоговора
	|		ПО (абсЗадачаДоговора.ОбъектЗадачи = ДоговорыКонтрагентов.Ссылка)
	|			И (абсЗадачаДоговора.Выполнена = ЛОЖЬ)
	|			И (ВЫБОР
	|				КОГДА ДоговорыКонтрагентов.абс_СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.абсСтатусыДоговоров.СогласованиеПД)
	|					ТОГДА ВЫБОР
	|							КОГДА абсЗадачаДоговора.ТочкаМаршрута.Порядок = 7
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				КОГДА ДоговорыКонтрагентов.абс_СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.абсСтатусыДоговоров.СогласованиеБухгалтерией)
	|					ТОГДА ВЫБОР
	|							КОГДА абсЗадачаДоговора.ТочкаМаршрута.Порядок = 52
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				КОГДА ДоговорыКонтрагентов.абс_СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.абсСтатусыДоговоров.ПроверкаДФМ)
	|					ТОГДА ВЫБОР
	|							КОГДА абсЗадачаДоговора.ТочкаМаршрута.Порядок = 5
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				КОГДА ДоговорыКонтрагентов.абс_СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.абсСтатусыДоговоров.Регистрация)
	|					ТОГДА ВЫБОР
	|							КОГДА абсЗадачаДоговора.ТочкаМаршрута.Порядок = 11
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				КОГДА ДоговорыКонтрагентов.абс_СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.абсСтатусыДоговоров.ДополнительноеСогласование)
	|					ТОГДА ВЫБОР
	|							КОГДА абсЗадачаДоговора.ТочкаМаршрута.Порядок = 81
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|			КОНЕЦ)
	|			И ((НЕ абсЗадачаДоговора.Исполнитель В
	|					(ВЫБРАТЬ
	|						РолиИИсполнители.Исполнитель
	|					ИЗ
	|						РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
	|					ГДЕ
	|						РолиИИсполнители.Роль = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.СуперПользователь))))
	|ГДЕ
	|	ДоговорыКонтрагентов.абс_СтатусДоговора = &СтатусДоговора
	|{ГДЕ
	|	ДоговорыКонтрагентов.Ссылка.*,
	|	ДоговорыКонтрагентов.абс_СтатусДоговора.*,
	|	абсЗадачаДоговора.Ссылка.*,
	|	абсЗадачаДоговора.Исполнитель.*,
	|	ДоговорыКонтрагентов.Владелец.*}
	|{ИТОГИ ПО
	|	ДоговорКонтрагента.*,
	|	СтатусДоговора.*,
	|	Задача.*,
	|	Исполнитель.*,
	|	Контрагент.*}";
	
	//// В универсальном отчете включен флаг использования свойств и категорий.
	//Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
	//	
	//	// Добавление свойств и категорий поля запроса в таблицу полей.
	//	// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
	//	
	//	// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Организация", "Организация", "Организация", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Проект", "Проект", "Проект", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Проекты);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Подразделение", "Подразделение", "Подразделение", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Подразделения);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Поставщик", "Поставщик", "Поставщик", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Покупатель", "Покупатель", "Покупатель", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ДоговорПокупателя", "ДоговорПокупателя", "Договор покупателя", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ДоговорыКонтрагентов);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры", "Характеристика номенклатуры", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ЗаказПокупателя", "ЗаказПокупателя", "Заказ покупателя", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ЗаказПокупателя", "ЗаказПокупателя", "Заказ покупателя", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документ_ЗаказПокупателя);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ДокументОприходования", "ДокументОприходования", "Документ оприходования", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
	//	
	//	// Добавление свойств и категорий в исходный текст запроса.
	//	УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
	//	
	//КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
		
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента"	, "Договор контрагента");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтатусДоговора"		, "Статус договора");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Задача"				, "Задача");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Исполнитель"			, "Исполнитель");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Контрагент"			, "Контрагент");
	
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВалютнаяСумма"	, "Валютная сумма");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	//УниверсальныйОтчет.ДобавитьПоказатель("ВалютнаяСумма", "Валютная сумма", Истина, "ЧЦ=15; ЧДЦ=2");
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Очистить();
	
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Контрагент");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ДоговорКонтрагента");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Исполнитель");
		
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Исполнитель");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	УчетнаяПолитика = ttk_ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиУпр(?(НЕ ЗначениеЗаполнено(УниверсальныйОтчет.ДатаКон), ТекущаяДата(), УниверсальныйОтчет.ДатаКон), Ложь);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("НеВключатьНДСВСтоимостьПартий", ?(НЕ ЗначениеЗаполнено(УчетнаяПолитика), Ложь, УчетнаяПолитика.НеВключатьНДСВСтоимостьПартий));
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СтатусДоговора", СтатусДоговора);
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент,,, ЭтотОбъект);

КонецПроцедуры // СформироватьОтчет()

Функция ПолучитьТекстСправкиФормы() Экспорт
	
	Возврат "";
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
